In [90]:
import pandas as pd

Importing CSV data

In [2]:
df = pd.read_csv('survey_results_public.csv')

df_survey = pd.read_csv('survey_results_schema.csv')
#df = pd.read_csv('survey_results_schema.csv')

In [323]:
df

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,YearsCodePro,DevType,...,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,5,Data scientist or machine learning specialist;...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,40205.0
3,4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,20,17,"Developer, full-stack",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,215232.0
4,5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,8,3,"Developer, front-end;Developer, full-stack;Dev...",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73263,73264,I am a developer by profession,"Employed, full-time",Fully remote,Freelance/contract work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Blogs;Written Tutorial...,Udemy,8,5,"Developer, back-end",...,Never,Never,30-60 minutes a day,Less than 15 minutes a day,Just right,DevOps function;Microservices;Developer portal...,Yes,Yes,Yes,Too long,Easy,NaN
73264,73265,I am a developer by profession,"Employed, full-time",Full in-person,Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Written Tutorial...,Coursera;Udemy;Udacity,6,5,Data scientist or machine learning specialist,...,6-10 times a week,10+ times a week,15-30 minutes a day,60-120 minutes a day,Very long,None of these,No,Yes,Yes,Too long,Easy,NaN
73265,73266,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby;School or academic work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Programming Games;Stac...,Udemy;Codecademy;Pluralsight;edX,42,33,"Developer, full-stack;Developer, desktop or en...",...,Never,Never,30-60 minutes a day,60-120 minutes a day,Just right,None of these,No,No,No,Appropriate in length,Easy,NaN
73266,73267,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;On the job training,NaN,NaN,50,31,"Developer, front-end;Developer, desktop or ent...",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",Fully remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,Udemy;Pluralsight,16,5,"Developer, front-end;Engineer, data;Engineer, ...",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN

In [332]:
#to treat custome null values like na missing no data as null
naval=['na','NA','Missing','no data','any custom value']
mydf = pd.read_csv('survey_results_public.csv', index_col = 'ResponseId', na_values=naval)
mydf

,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,YearsCodePro,DevType,OrgSize,...,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
ResponseId,,,,,,,,,,,,,,,,,,,,,,,,,
1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN
3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,5,Data scientist or machine learning specialist;...,20 to 99 employees,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,40205.0
4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,20,17,"Developer, full-stack",100 to 499 employees,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,215232.0
5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,8,3,"Developer, front-end;Developer, full-stack;Dev...",20 to 99 employees,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73264,I am a developer by profession,"Employed, full-time",Fully remote,Freelance/contract work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Blogs;Written Tutorial...,Udemy,8,5,"Developer, back-end",100 to 499 employees,...,Never,Never,30-60 minutes a day,Less than 15 minutes a day,Just right,DevOps function;Microservices;Developer portal...,Yes,Yes,Yes,Too long,Easy,NaN
73265,I am a developer by profession,"Employed, full-time",Full in-person,Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Written Tutorial...,Coursera;Udemy;Udacity,6,5,Data scientist or machine learning specialist,I don’t know,...,6-10 times a week,10+ times a week,15-30 minutes a day,60-120 minutes a day,Very long,None of these,No,Yes,Yes,Too long,Easy,NaN
73266,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby;School or academic work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Programming Games;Stac...,Udemy;Codecademy;Pluralsight;edX,42,33,"Developer, full-stack;Developer, desktop or en...",20 to 99 employees,...,Never,Never,30-60 minutes a day,60-120 minutes a day,Just right,None of these,No,No,No,Appropriate in length,Easy,NaN
73267,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;On the job training,NaN,NaN,50,31,"Developer, front-end;Developer, desktop or ent...",10 to 19 employees,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN
73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",Fully remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,Udemy;Pluralsight,16,5,"Developer, front-end;Engineer, data;Engineer, ...",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN

In [333]:
mydf[['Country','RemoteWork']].value_counts()

Country                   RemoteWork
United States of America  Fully remote                            6771
                          Hybrid (some remote, some in-person)    3634
Germany                   Hybrid (some remote, some in-person)    2529
India                     Fully remote                            1952
                          Hybrid (some remote, some in-person)    1942
                                                                  ...
Togo                      Hybrid (some remote, some in-person)       1
Botswana                  Full in-person                             1
Kuwait                    Fully remote                               1
Nomadic                   Full in-person                             1
Seychelles                Full in-person                             1
Length: 474, dtype: int64

In [335]:
# find dataframe column unique values
mydf['RemoteWork'].unique()

array([nan, 'Fully remote', 'Hybrid (some remote, some in-person)',
       'Full in-person'], dtype=object)

In [3]:
#this is specific to pandas no reference to dataframe
pd.set_option('display.max_column',50)

In [4]:
#df.info() - list of column with name and datatype
df.head() #list sample record from df
df.shape # give number of rows and column in DF

(73268, 79)

In [5]:
df_survey.head(2)
df.head(2)

df_survey[['qname','type']]
df_survey.head(5)
#df_survey.set_index('qid', inplace=True)
#df_survey.reset_index(inplace=True)

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB
1,QID12,MetaInfo,Browser Meta Info,False,Meta,Browser
2,QID1,S1,"<span style=""font-size:22px; font-family: aria...",False,DB,TB
3,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
4,QID296,Employment,Which of the following best describes your cur...,False,MC,MAVR

In [6]:
#Conditional record search by using AND & /OR | operator
df_survey.loc[(df_survey['qname']=='S0') & (df_survey['qid']=='QID16')]

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB

In [7]:
#number of row and column along with column info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 79 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   ResponseId                      73268 non-null  int64
 1   MainBranch                      73268 non-null  object
 2   Employment                      71709 non-null  object
 3   RemoteWork                      58958 non-null  object
 4   CodingActivities                58899 non-null  object
 5   EdLevel                         71571 non-null  object
 6   LearnCode                       71580 non-null  object
 7   LearnCodeOnline                 50685 non-null  object
 8   LearnCodeCoursesCert            29389 non-null  object
 9   YearsCode                       71331 non-null  object
 10  YearsCodePro                    51833 non-null  object
 11  DevType                         61302 non-null  object
 12  OrgSize                         51039 non-null  object
 13  PurchaseInfluence               50969 non-null  object
 14  BuyNewTool                      67963 non-null  object
 15  Country                         71771 non-null  object
 16  Currency                        51264 non-null  object
 17  CompTotal                       38422 non-null  float64
 18  CompFreq                        44425 non-null  object
 19  LanguageHaveWorkedWith          70975 non-null  object
 20  LanguageWantToWorkWith          67027 non-null  object
 21  DatabaseHaveWorkedWith          60121 non-null  object
 22  DatabaseWantToWorkWith          51014 non-null  object
 23  PlatformHaveWorkedWith          49924 non-null  object
 24  PlatformWantToWorkWith          40415 non-null  object
 25  WebframeHaveWorkedWith          53544 non-null  object
 26  WebframeWantToWorkWith          46122 non-null  object
 27  MiscTechHaveWorkedWith          44992 non-null  object
 28  MiscTechWantToWorkWith          36810 non-null  object
 29  ToolsTechHaveWorkedWith         54171 non-null  object
 30  ToolsTechWantToWorkWith         46566 non-null  object
 31  NEWCollabToolsHaveWorkedWith    70347 non-null  object
 32  NEWCollabToolsWantToWorkWith    64108 non-null  object
 33  OpSysProfessional use           65503 non-null  object
 34  OpSysPersonal use               70963 non-null  object
 35  VersionControlSystem            71379 non-null  object
 36  VCInteraction                   68156 non-null  object
 37  VCHostingPersonal use           0 non-null      float64
 38  VCHostingProfessional use       0 non-null      float64
 39  OfficeStackAsyncHaveWorkedWith  46223 non-null  object
 40  OfficeStackAsyncWantToWorkWith  32072 non-null  object
 41  OfficeStackSyncHaveWorkedWith   62128 non-null  object
 42  OfficeStackSyncWantToWorkWith   47688 non-null  object
 43  Blockchain                      71071 non-null  object
 44  NEWSOSites                      71365 non-null  object
 45  SOVisitFreq                     70961 non-null  object
 46  SOAccount                       71572 non-null  object
 47  SOPartFreq                      58229 non-null  object
 48  SOComm                          71408 non-null  object
 49  Age                             70946 non-null  object
 50  Gender                          70853 non-null  object
 51  Trans                           70315 non-null  object
 52  Sexuality                       66565 non-null  object
 53  Ethnicity                       69474 non-null  object
 54  Accessibility                   67244 non-null  object
 55  MentalHealth                    66447 non-null  object
 56  TBranch                         52670 non-null  object
 57  ICorPM                          36283 non-null  object
 58  WorkExp                         36769 non-null  float64
 59  Knowledge_1                     35804 non-null  object
 60  Knowledge_2                     34973 non-null  object
 61  Knowledge_3                     35133 non-null  object
 62  Knowledge_4                     35097 non-null  object
 63  Knowledge_5                     35014 non-null  object
 64  Knowledge_6                     34991 non-null  object
 65  Knowledge_7                     34977 non-null  object
 66  Frequency_1                     35371 non-null  object
 67  Frequency_2                     35344 non-null  object
 68  Frequency_3                     34515 non-null  object
 69  TimeSearching                   36198 non-null  object
 70  TimeAnswering                   36022 non-null  object
 71  Onboarding                      35679 non-null  object
 72  ProfessionalTech                34906 non-null  object
 73  TrueFalse_1                     35819 non-null  object
 74  TrueFalse_2                     35715 non-null  object
 75  TrueFalse_3                     35749 non-null  object
 76  SurveyLength                    70444 non-null  object
 77  SurveyEase                      70508 non-null  object
 78  ConvertedCompYearly             38071 non-null  float64
dtypes: float64(5), int64(1), object(73)
memory usage: 44.2+ MB

In [8]:
#this set the number of columns or rows of the dataframe to be display
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_rows',6)
df

,ResponseId,MainBranch,Employment,...,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,...,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",...,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time",...,Appropriate in length,Neither easy nor difficult,40205.0
...,...,...,...,...,...,...,...
73265,73266,"I am not primarily a developer, but I write co...","Employed, full-time",...,Appropriate in length,Easy,NaN
73266,73267,I am a developer by profession,"Employed, full-time",...,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",...,Appropriate in length,Easy,NaN

In [92]:
#Python dictionary to prepare manual dataset to create Pandas DataFrame
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010],
    'fname': ['Jack','Tom','Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home','Office'],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English'
                ]
         }

In [10]:
#Way to access python dictionary
people['email']

['jack.foly@email',
 'tom.alter@email',
 'traci.saw@email',
 'rosy.burk@email',
 'jack@email',
 'jhon.dow@email.com',
 'jenny.dow@email.com',
 'tom.hanks@email.com',
 'saurabh.raj@email.com',
 'td@email.com']

In [94]:
#Pandas dataframe is similar but proivde more functionality over data and can visulize more redable form

df_people = pd.DataFrame(people)

#access dataframe multiple column values
#df_people[['fname','lname']]
#df_people

In [12]:
pd.set_option('display.max_columns',10)
#accessing row using integer location iloc method, additionally you can locate range of records by using the : colon
#or use the list squar bracket to pass the record index to diaplay, remember end range number is excluded
df_people.iloc[1:4]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python

In [13]:
df_people.iloc[[1,2,3,4]]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish

In [14]:
#listout the dataframe columns
df_people.columns

Index(['id', 'fname', 'lname', 'email', 'country', 'work mode', 'dept',
       'emp_type', 'language'],
      dtype='object')

In [15]:
#Info about DataFrame row index, starting row index and Df last record df 
df_people.index

RangeIndex(start=0, stop=10, step=1)

# Note: You can also access the df by dot notation, but be caucious when df column and method name are same in this case python will call method rather then column

if you have column name EMP as well as method EMP in this case python will use method or give error better use the brackets for best practice

In [16]:
df_people.fname

0     Jack
1      Tom
2    Traci
     ...
7      Tom
8      Raj
9    Terry
Name: fname, Length: 10, dtype: object

In [95]:
#multiple column is not series type its again a df
#series is one diamentional array for one column and values
type(df_people[['fname','lname']])

pandas.core.frame.DataFrame

In [96]:
#access data frame column's
pd.set_option('display.max_rows',10)
df_people[['fname','email','work mode','id']]

   fname                  email       work mode    id
0   Jack        jack.foly@email          remote  1001
1    Tom        tom.alter@email  work from home  1003
2  Traci        traci.saw@email          office  1002
3   Rosy        rosy.burk@email     head office  1004
4   Jack             jack@email          remote  1005
5   Jhon     jhon.dow@email.com          office  1006
6  Jenny    jenny.dow@email.com          Remote  1007
7    Tom    tom.hanks@email.com          office  1008
8    Raj  saurabh.raj@email.com  work from home  1009
9  Terry           td@email.com          Office  1010

In [19]:
#filtering specific record from dataframe without loc or iloc
df_people[(df_people['work mode']=='remote') & (df_people['email']=='jack@email')] [['fname','lname']]

  fname       lname
4  Jack  jack@email

In [20]:
type(df_people['fname'])

pandas.core.series.Series

# value.counts() method can also be use as group by clause to group the data based on number of columns

In [225]:
#count the values get percentage %age instead of count use normalize=True for decimal %age additionally you can add *100
#df_people.rename(columns={'work mode':'work_mode'}, inplace=True)
df_people[['fname','work_mode']].value_counts(normalize=True)

fname  work_mode
Jack   remote            0.2
Jenny  Remote            0.1
Jhon   office            0.1
Raj    work from home    0.1
Rosy   head office       0.1
Terry  Office            0.1
Tom    office            0.1
       work from home    0.1
Traci  office            0.1
dtype: float64

# rename DataFrame column name df.rename(columns = {old:new,}, inplace=True)

In [22]:
df_people.rename(columns = {'work mode':'work_mode'}, inplace=True)

In [23]:
df_people.reset_index(inplace=True)

In [24]:
#loc[row/[rows]], column/[columns] for range no need to use the list bracket
df_people.loc[[1,2], ['email','fname']]

             email  fname
1  tom.alter@email    Tom
2  traci.saw@email  Traci

In [25]:
df_people.set_index('id', inplace=True)

In [26]:
#though index is changed to id but iloc still using the numerical index values
df_people.iloc[[1,2,0],[1,4,5]]

      fname country       work_mode
id
1003    Tom      UK  work from home
1002  Traci   India          office
1001   Jack     USA          remote

In [27]:
df_people.columns

Index(['index', 'fname', 'lname', 'email', 'country', 'work_mode', 'dept',
       'emp_type', 'language'],
      dtype='object')

loc and iloc
#iloc and loc both reference to dataframe rows by index, iloc access integer index where loc access rows by label

# Query Dataframe Rows use the loc and iloc (iloc is integer location of row) and loc row label both point to row only
eg. if you have reset your default index(0-~)you can not give reference to filter row on index 0 or 1 because this index is no longer available, but you can still refer the loc which is label like record 1 or 10th record etc
iloc: search by row index
loc: search by label

In [28]:

df.iloc[[0,2]]
#if we want email column for selected two row in this case use the column index outside list

df.iloc[[0,2],1:3]
#df

                                          MainBranch           Employment
0                                      None of these                  NaN
2  I am not primarily a developer, but I write co...  Employed, full-time

In [111]:
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English

In [103]:
# apply is used to apply the method on the dataframe or run the lambda etc, see the eg custom function
df_people['fname'].apply(len)

0    4
1    3
2    5
3    4
4    4
5    4
6    5
7    3
8    3
9    5
Name: fname, dtype: int64

In [102]:
df_people[['fname','fname','email']].apply(len)

fname    10
fname    10
email    10
dtype: int64

In [122]:
def email_case(email):
    return email.upper()

#email_case(df_people['email']) this will fail with erro that 'Series' object has no attribute 'upper' instead use the apply

In [125]:
#df_people['email'].apply(email_case) #to apply the changes assign it to series as below
df_people['email'] = df_people['email'].apply(email_case)

In [128]:
#you can also directly use the lambda to run the no name function in apply
df_people['email'] = df_people['email'].apply(lambda x: x.lower())
df_people #email changes back to lower case

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English

In [130]:
df_people.apply(len, axis='columns')
#this tells numbers of columns in each row, axis='rows' is default

0    9
1    9
2    9
3    9
4    9
5    9
6    9
7    9
8    9
9    9
dtype: int64

In [131]:
df_people.apply(len, axis='rows')

id           10
fname        10
lname        10
email        10
country      10
work mode    10
dept         10
emp_type     10
language     10
dtype: int64

# applymap used to apply a function to every element of dataframe 
applymap only works on DF not on Series
unlike apply(len) on df gives number of element in each series applymap gives us the lenght of each column value

In [143]:
# IF DataFrame is full of str columns then applymap will work
#note this throw error if Df have number type column so here, id is changing to index to avoid error
#df_people.set_index('id', inplace=True)
df_people.applymap(len) #>=10 conditional

      fname  lname  email  country  work mode  dept  emp_type  language
id
1001      4      4     15        3          6     2         3        14
1003      3      5     15        2         14     5         3        22
1002      5      3     15        5          6     9         3        13
1004      4      4     15        6         11     5         3        21
1005      4     10     10        7          6     5         3        26
1006      4      3     18        3          6     9         3        18
1007      5      3     19        3          6     5         3        12
1008      3      5     19        2          6     5         3        20
1009      3      7     21        5         14     2         3        19
1010      5      3     12        3          6     7         3         7

In [ ]:
#MAP is generally used to substitute the Series column values, note if any value is not matched in map it make is NaN
# this method is good to converted if you column value like Yes/No and convert it to True/False
#else use the rename

In [ ]:
#dataframe column condition return the record with Boolean value for matching record True and rest False]- id is index here so don't get confuse
df_people['fname']=='Jack'

In [ ]:
df_people.set_index('fname', inplace=True)

In [ ]:
#now index is set for fname now you can use the loc on fname to find the records
df_people.loc['Jack']

In [ ]:
df_people.reset_index(inplace=True)

In [ ]:
df_people['lname']=='Dow'

In [ ]:
filt = df_people['lname']=='Dow'
#filt = df_people[df_people['lname']=='Dow'] direct dataframe values can not be used as filte
filt

In [ ]:
df_people.loc[filt]# you can also chooes the column values as needed

~ symbol reverse(negate) the condition, filt condition become not condition

In [ ]:
df_people.loc[~filt]# you can also chooes the column values as needed

In [ ]:
#filter can be used directly to dataframe as well as with loc
#as we know we can also chooes the number of columns we want from dataframe except specific row but loc provide option to 
#select the row along with column values

df_people[filt] [['id','fname','email']].value_counts()

In [ ]:
df_people.loc[filt, ['fname','lname','email']]

In [ ]:
df_people[df_people['lname']=='Dow']

# Pandas AND and OR Operators (& and |)

In [ ]:
df_filter = (df_people['fname']=='Jack') | (df_people['lname']=='Dow')

In [ ]:
df_people[df_filter]

In [ ]:
#Dataframe isin() method is used to pass the additional filter to dataframe

In [ ]:
country_filter = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow')

In [ ]:
#same result for both method
df_people[country_filter]
df_people.loc[country_filter]

# isin() method to validate column values like Oracle in - df['column'].isin([cols value])

In [ ]:
country_filter1 = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow') & (df_people['id'] < 1010)
df_people[country_filter1]

In [ ]:
type(country_filter1)

# Dataframe str.contains() method helps to find the specific text in the column
df['column'].str.contain(value)

In [ ]:
lang_fil = (df_people['language'].str.contains('Spanish'))

In [ ]:
# pd.set_option('display.max_rows',25)
#df_people.fillna(-1, inplace=True)

df_people

# Describe and max(), min() method

In [ ]:
df_people[['id','fname','country']].min()
#df_people['id'].max()

In [ ]:
#aggregate DF group by column mentioned
df_people[['fname','work_mode']].value_counts()

In [ ]:
df_people['id'].max()

In [ ]:
#Caution - extract mininum value from Each dataframe column
df_people.apply([pd.Series.min])

In [195]:
#use list in case data needed in row else skip the squar bracket to get data in column
df_people.apply([lambda x: x.min()])

,level_0,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
<lambda>,0,0,1001,Jack,Alter,jack.foly@email,Canada,Office,Admin,cwx,Dutch;English,1000.0

In [ ]:
#Operation on pandas Series
s = pd.Series([10,12,14,15,18])
a=18
print("Series max value is --> ",s.max())
if s.max()==a:
    print("Series value is equal to variable")

y = (x for x in range(1,20) if x==s.max())
y1 = [x for x in range(1,20) if x==s.max()]
print("value From generator matching Series is --> ", sum(y))
print("Object Y is: ", y, " and Object Y1 is ", type(y1))

In [ ]:
#describe the dataframe with basic mean medium std and %tile values for numerical fields
df_people.describe()

In [ ]:
#top 5 record use tail for top bottom records

df_people.head(5)

df_people.tail(5)

# Update Dataframe record values

In [ ]:
df_people[(df_people['lname']=='Dow') & (df_people['fname']=='Jenny')]

In [ ]:
#updating fname to Ronny

df_people.loc[(df_people['lname']=='Dow') & (df_people['fname']=='Jenny'),['fname','email']] = ['Ronny','ronny.dow@email.com']

In [ ]:
#if you know the index for the record you wish to change
#dataframe.loc[index,[column's-to-update]] = [new-column-value]
df_people.loc[6, ['fname','email']] = ['Rock','rock.dow@email.com']

In [ ]:
df_people.loc[df_people['emp_type']=='emp','emp_type'] = 'Emp'

In [ ]:
df_people

In [ ]:
df_people[~((df_people['fname']=='Rock') & (df_people['lname']=='Dow'))]

In [ ]:
df_people[(df_people['fname']=='Rock') & (df_people['lname']=='Dow')]

In [ ]:
#update two column by using index reference
df_people.loc[3,['lname','email']]= ['Dilt','rosy.dilt@email.com']

In [ ]:
#AT can also be use in place of loc --somehow giving error to update multiple column values but values are getting change i guess this ment only for 1 value

#df_people.at[3,['lname','email']]= ['Hanson','rosy.hanson@email.com']
df_people.at[3, 'lname'] = 'Hanson'

In [ ]:
#update column all value to upper or other operation

df_people['emp_type'] = df_people['emp_type'].str.upper()

# apply, map, applymap and replace method

In [298]:
#here find the record and chooes the column and see the lenth of that column value
df_people.loc[df_people['email']=='td@email.com','fname']
df_people.loc[df_people['email']=='td@email.com','fname'].apply(len)

9    5
Name: fname, dtype: int64

In [91]:
df_people.loc[df_people['lname']=='Dow', 'email']

NameError: name 'df_people' is not defined

In [ ]:
df_people.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()
#df_people['emp_type'] = df_people.loc[df_people['emp_type']=='cwx','emp_type'].apply(lambda x: x.upper())

#don't update the dataframe field value as this gives the all DF records with matching and non matching records and for non matching criteria value will update to NaN
dfp['emp_type'] =dfp.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()

In [ ]:
dfp

In [ ]:
df_p = df_people['email'].str.upper()
#this will create new dataframe with selected values
df_p

In [ ]:
#update value for emp field
df_people.loc[df_people['emp_type']!='CWX','emp_type'] = 'Emp'

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.upper()
df_people

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.lower()
df_people

In [13]:
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010,'no data'],
    'fname': ['Jack',
              'Tom',
              'Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry','na'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow','Missing'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email',
              'jhon.dow@email.com',
              'jenny.dow@email.com',
              'tom.hanks@email.com',
              'saurabh.raj@email.com',
              'td@email.com',
             'Missing'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA','NA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home',
                  'Office', None],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance','Missing'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp','na'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English',
                 'Missing'
                ]
         }

In [26]:
#length of the dictionary values in list
len(people['lname'])

11

In [15]:
import pandas as pd
import numpy as np
pdf = pd.DataFrame(people)

In [16]:
pdf
#.loc[9, 'language'] = 'Zulu;English'

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English
10,no data,na,Missing,Missing,NA,None,Missing,na,Missing

In [17]:
(pdf['lname']=='Dow') | (pdf['fname']=='Tom')

0     False
1      True
2     False
3     False
4     False
5      True
6      True
7      True
8     False
9      True
10    False
dtype: bool

In [ ]:
# this is good to filter the record but for update it will update for matching row but rest of them become NaN
pdf.loc[f, 'emp_type'].str.upper()

In [ ]:
a= None
b=np.nan

if a==b:
    print('Yes')
else:
    print('NaN and None is not equal')

In [ ]:
pdf['emp_type'] = pdf['emp_type'].str.lower()

In [ ]:
#delete dataframe -- result after executing given del statment 
del pdff

In [20]:
#get the lenght of the field, remeber here email set as custome index to reference record default is integer index
pdf[['fname','lname']].apply(len)

fname    11
lname    11
dtype: int64

In [33]:
#This tell how many record each column have in DF, default axis is rows
pdf.apply(len)

id           11
fname        11
lname        11
email        11
country      11
work mode    11
dept         11
emp_type     11
language     11
dtype: int64

In [34]:
#this Tells DF have 9 Columns values in each row, except index, incase custom index is set that will not count
pdf.apply(len, axis='columns')

0     9
1     9
2     9
3     9
4     9
5     9
6     9
7     9
8     9
9     9
10    9
dtype: int64

In [2]:
#minimum character in DF fname column, first is length and 2nd int is occurance as per 

#pdf.set_index('email', inplace=True)
pdf['fname'].apply(len).value_counts()
#pdf['fname'].max()

NameError: name 'pdf' is not defined

In [ ]:
pdf['fname']

In [88]:
#find NaN value in DF Column
pdf['id'].isnull().values.any()
#update NaN value in DF column as needed
pdf['id'].fillna(0, inplace=True)
pdf.fillna('Missing', inplace=True)
pdf

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001.0,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003.0,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002.0,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004.0,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005.0,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006.0,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007.0,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008.0,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009.0,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010.0,Terry,Dow,td@email.com,USA,Office,Finance,emp,English
10,0.0,Missing,Missing,Missing,Missing,Missing,Missing,Missing,Missing

In [89]:
# Series min or max with apply() give you the min/max value of each column from dataset
#, since each column in dataset is Series
# remember to use the pd.Series which means apply the pandas Series min/max method on dataframe

pdf.apply(pd.Series.max)
#pdf.replace({'Missing':np.nan, 'None': None, 'na':None, 'NA':None, 'no data': np.nan}, inplace=True)

id                           1010.0
fname                         Traci
lname                    jack@email
email               traci.saw@email
country                         USA
work mode            work from home
dept                             VP
emp_type                        emp
language     Spanish;French;English
dtype: object

In [ ]:
#Same can be done by using the lambda

pdf.apply(lambda x: x.max())

In [ ]:
pdf

In [ ]:
#change the value for column values we can use replace method
#update multiple row column values
pdf['lname']= pdf['lname'].replace({'Sharma':'Burk', 'Saurabh':'Kumar'})

In [ ]:
pdf.loc[[3,8]]

# Change column name or rename column name, use inplace=True to apply the change

In [ ]:
#pdf.rename(columns = {'id':'emp_id'}, inplace=True)
#update column header name DataFrame.replace(colums = {'existing_name':'new_name'})
pdf.rename(columns = {'id':'emp_id'})

In [ ]:
pdf

# Insert and update Records
# Handling Null value in Df
# dropna(axis=index/columns, how='all/any')
all= delete row or column when all values are null
any = delete row or column when any value in df is null/NaN

In [33]:
import numpy as np
emp_data = {'fname': ['sample','Jack',np.nan,'Traci','Rosy','Jack','Jhon','NULL','Tom','Raj','Terry'],
            'lname': [np.nan,'Foly','NA',np.nan,'NA','jack@email','Dow','Dow','Hanks','Saurabh','Missing'], 
            'email': [np.nan,'jack.foly@email',None,'traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
            'age':[15,10,np.nan,11,23,45,65,43,2,4,None],
            'zip':[10001,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,'NA']
           }

In [34]:
ndf = pd.DataFrame(emp_data)
pd.set_option('display.max_rows',12)
#display at least 12 rows for all DF its not only for this

In [35]:
ndf
#ndf.loc[9]=None

     fname       lname                  email   age    zip
0   sample         NaN                    NaN  15.0  10001
1     Jack        Foly        jack.foly@email  10.0    NaN
2      NaN          NA                   None   NaN    NaN
3    Traci         NaN        traci.saw@email  11.0    NaN
4     Rosy          NA        rosy.burk@email  23.0    NaN
5     Jack  jack@email             jack@email  45.0    NaN
6     Jhon         Dow     jhon.dow@email.com  65.0    NaN
7     NULL         Dow    jenny.dow@email.com  43.0    NaN
8      Tom       Hanks    tom.hanks@email.com   2.0    NaN
9      Raj     Saurabh  saurabh.raj@email.com   4.0    NaN
10   Terry     Missing           td@email.com   NaN     NA

In [36]:
ndf=ndf.append({'full_name':'NAMissing None','fname':'NAKumar','email':'MissingNA@email.com','gender':None}, ignore_index=True)
ndf

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_2980/3004757393.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ndf=ndf.append({'full_name':'NAMissing None','fname':'NAKumar','email':'MissingNA@email.com','gender':None}, ignore_index=True)

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,None

In [37]:
cond = ndf['email']=='MissingNA@email.com'

In [38]:
ndf.drop(index=ndf[cond].index)

     fname       lname                  email   age    zip full_name gender
0   sample         NaN                    NaN  15.0  10001       NaN    NaN
1     Jack        Foly        jack.foly@email  10.0    NaN       NaN    NaN
2      NaN          NA                   None   NaN    NaN       NaN    NaN
3    Traci         NaN        traci.saw@email  11.0    NaN       NaN    NaN
4     Rosy          NA        rosy.burk@email  23.0    NaN       NaN    NaN
5     Jack  jack@email             jack@email  45.0    NaN       NaN    NaN
6     Jhon         Dow     jhon.dow@email.com  65.0    NaN       NaN    NaN
7     NULL         Dow    jenny.dow@email.com  43.0    NaN       NaN    NaN
8      Tom       Hanks    tom.hanks@email.com   2.0    NaN       NaN    NaN
9      Raj     Saurabh  saurabh.raj@email.com   4.0    NaN       NaN    NaN
10   Terry     Missing           td@email.com   NaN     NA       NaN    NaN

In [39]:
ndf.replace({'MissingNA@email.com': 'noemp@email.com'}, inplace=True, method='bfill')

In [40]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

In [41]:
ndf.replace({None:'np.nan','Missing':np.nan,None:np.nan})

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,NaN,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,NaN,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

In [42]:
#Replace dataset custom null/na/missing values
#remember if no dataframe column specified in this case it will search value in all DF columns for replacement

ndf.replace({'NA':np.nan, None:np.nan, 'Missing':np.nan})
#after reviewing DF changes, use inplace=True to make permanent changes in DF

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001.0,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NaN,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,NaN,td@email.com,NaN,NaN,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

# here entire zip field is dropped because of how='all' option, with 'any' option all df records will dropped because in df have NaN/None value in each column

In [43]:
ndf.dropna(axis='columns', how='all')

      fname       lname                  email   age    zip       full_name
0    sample         NaN                    NaN  15.0  10001             NaN
1      Jack        Foly        jack.foly@email  10.0    NaN             NaN
2       NaN          NA                   None   NaN    NaN             NaN
3     Traci         NaN        traci.saw@email  11.0    NaN             NaN
4      Rosy          NA        rosy.burk@email  23.0    NaN             NaN
5      Jack  jack@email             jack@email  45.0    NaN             NaN
6      Jhon         Dow     jhon.dow@email.com  65.0    NaN             NaN
7      NULL         Dow    jenny.dow@email.com  43.0    NaN             NaN
8       Tom       Hanks    tom.hanks@email.com   2.0    NaN             NaN
9       Raj     Saurabh  saurabh.raj@email.com   4.0    NaN             NaN
10    Terry     Missing           td@email.com   NaN     NA             NaN
11  NAKumar         NaN        noemp@email.com   NaN    NaN  NAMissing None

#Conditionally deletion of rows and columns for
# Conditon 1 - eg. delete 'na' rows if lname or email is null
# here 'HOW" play important role to drop after evaluating the list of cols in subset if how set to all in this case conditon will evalueate all the subset cols needs to be null to drop from df check Condition 2

In [44]:
ndf.dropna(axis='index', how='any', subset=['lname','email'])

    fname       lname                  email   age  zip full_name  gender
1    Jack        Foly        jack.foly@email  10.0  NaN       NaN     NaN
4    Rosy          NA        rosy.burk@email  23.0  NaN       NaN     NaN
5    Jack  jack@email             jack@email  45.0  NaN       NaN     NaN
6    Jhon         Dow     jhon.dow@email.com  65.0  NaN       NaN     NaN
7    NULL         Dow    jenny.dow@email.com  43.0  NaN       NaN     NaN
8     Tom       Hanks    tom.hanks@email.com   2.0  NaN       NaN     NaN
9     Raj     Saurabh  saurabh.raj@email.com   4.0  NaN       NaN     NaN
10  Terry     Missing           td@email.com   NaN   NA       NaN     NaN

In [45]:
ndf.replace({'NA':np.nan, 'NULL':np.nan,None:np.nan})

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001.0,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NaN,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NaN,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NaN,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

In [46]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

# condition 2 - drop row when lname and email both are missing

In [47]:
ndf.dropna(axis='index', how='all', subset=['lname','email'])
# use inplace = True to update the dataframe with your changes

,fname,lname,email,age,zip,full_name,gender
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN

In [48]:
# search  NaN value in DF

ndf.isna()

    fname  lname  email    age    zip  full_name  gender
0   False   True   True  False  False       True    True
1   False  False  False  False   True       True    True
2    True  False   True   True   True       True    True
3   False   True  False  False   True       True    True
4   False  False  False  False   True       True    True
5   False  False  False  False   True       True    True
6   False  False  False  False   True       True    True
7   False  False  False  False   True       True    True
8   False  False  False  False   True       True    True
9   False  False  False  False   True       True    True
10  False  False  False   True  False       True    True
11  False   True  False   True   True      False    True

In [49]:
#update NaN value with text or number
ndf.fillna("missing")
ndf.fillna(-1)

,fname,lname,email,age,zip,full_name,gender
0,sample,-1,-1,15.0,10001,-1,-1.0
1,Jack,Foly,jack.foly@email,10.0,-1,-1,-1.0
2,-1,NA,-1,-1.0,-1,-1,-1.0
3,Traci,-1,traci.saw@email,11.0,-1,-1,-1.0
4,Rosy,NA,rosy.burk@email,23.0,-1,-1,-1.0
5,Jack,jack@email,jack@email,45.0,-1,-1,-1.0
6,Jhon,Dow,jhon.dow@email.com,65.0,-1,-1,-1.0
7,NULL,Dow,jenny.dow@email.com,43.0,-1,-1,-1.0
8,Tom,Hanks,tom.hanks@email.com,2.0,-1,-1,-1.0
9,Raj,Saurabh,saurabh.raj@email.com,4.0,-1,-1,-1.0
10,Terry,Missing,td@email.com,-1.0,NA,-1,-1.0
11,NAKumar,-1,noemp@email.com,-1.0,-1,NAMissing None,-1.0

In [50]:
#ndf.replace({-1,np.nan}, inplace=True)

ndf.dtypes

fname         object
lname         object
email         object
age          float64
zip           object
full_name     object
gender       float64
dtype: object

# convert df column datatype use df[column].astype(float/int)

# check df column datatype df.dtype()

In [51]:
#zip column in DF is object type reason being mathmatical function can not be performed
#in this case this column need to be cast to int / float to do that, first string or null values need to be handled

ndf['zip'].replace({'NA':0}, inplace=True)
ndf['zip'].astype(float)

0     10001.0
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8         NaN
9         NaN
10        0.0
11        NaN
Name: zip, dtype: float64

In [52]:
ndf['zip'].mean()

5000.5

# ADD / Delete column from DataFrame

In [53]:
#adding new column full_name

ndf['full_name'] = ndf['fname'] +' '+ ndf['lname']

In [54]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001.0,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,Jack Foly,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,Rosy NA,NaN
5,Jack,jack@email,jack@email,45.0,NaN,Jack jack@email,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,Jhon Dow,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NULL Dow,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,Tom Hanks,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,Raj Saurabh,NaN
10,Terry,Missing,td@email.com,NaN,0.0,Terry Missing,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NaN,NaN

In [55]:
#str.split method to re-add fname and lname column in df
ndf['full_name'].str.split(' ')

0                    NaN
1           [Jack, Foly]
2                    NaN
3                    NaN
4             [Rosy, NA]
5     [Jack, jack@email]
6            [Jhon, Dow]
7            [NULL, Dow]
8           [Tom, Hanks]
9         [Raj, Saurabh]
10      [Terry, Missing]
11                   NaN
Name: full_name, dtype: object

In [94]:
#this will seperate the value in columns structure that can be addded to df in next 
ndf[['fname','lname']] = ndf['full_name'].str.split(' ', expand=True)

In [57]:
# Adding Two column in DF
ndf[['fname','lname']] = ndf['full_name'].str.split(' ', expand=True)

In [95]:
ndf

                    email   age  zip      full_name  gender fname     lname
1                    None   NaN  NaN            NaN     NaN   NaN      None
2         traci.saw@email  11.0  NaN            NaN     NaN   NaN      None
3         rosy.burk@email  23.0  NaN            NaN     NaN   NaN      None
4              jack@email  45.0  NaN            NaN     NaN   NaN      None
5      jhon.dow@email.com  65.0  NaN            NaN     NaN   NaN      None
..                    ...   ...  ...            ...     ...   ...       ...
47  saurabh.raj@email.com   4.0  NaN            NaN     NaN   NaN      None
48           td@email.com   NaN  0.0            NaN     NaN   NaN      None
49        noemp@email.com   NaN  NaN            NaN     NaN   NaN      None
50                    NaN   NaN  NaN            NaN     NaN   NaN      None
51                    NaN   NaN  NaN  Rosy Wakeford     NaN  Rosy  Wakeford

[51 rows x 7 columns]

In [59]:
#add column in df
ndf['gender']=np.nan

In [88]:
#add row use df.append(obj, ignore_index=True, sort=False/True)
ndf

                    email   age  zip      full_name  gender
1                    None   NaN  NaN            NaN     NaN
2         traci.saw@email  11.0  NaN            NaN     NaN
3         rosy.burk@email  23.0  NaN            NaN     NaN
4              jack@email  45.0  NaN            NaN     NaN
5      jhon.dow@email.com  65.0  NaN            NaN     NaN
..                    ...   ...  ...            ...     ...
47  saurabh.raj@email.com   4.0  NaN            NaN     NaN
48           td@email.com   NaN  0.0            NaN     NaN
49        noemp@email.com   NaN  NaN            NaN     NaN
50                    NaN   NaN  NaN            NaN     NaN
51                    NaN   NaN  NaN  Rosy Wakeford     NaN

[51 rows x 5 columns]

In [75]:
#insert record, Remember to assign the value to DF other wise insert will not take effect

ndf = ndf.append({'fname':'Rosy','lname':'Wakeford'}, ignore_index=True)

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_2980/1952853667.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ndf = ndf.append({'fname':'Rosy','lname':'Wakeford'}, ignore_index=True)

In [80]:
#this is adding two column in DF
ndf1 = ndf
ndf1[['gender','full_name']]= [np.nan, ndf1['fname'] + ' ' + ndf1['lname']]

/Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages/numpy/core/fromnumeric.py:3156: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  return asarray(a).ndim
/Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages/numpy/core/fromnumeric.py:2009: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  result = asarray(a).shape

In [63]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,NaN,NaN,NaN,15.0,10001.0,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,Jack Foly,NaN
2,NaN,NaN,None,NaN,NaN,NaN,NaN
3,NaN,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,Rosy NA,NaN
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,Tom Hanks,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,Raj Saurabh,NaN
10,Terry,Missing,td@email.com,NaN,0.0,Terry Missing,NaN
11,NaN,NaN,noemp@email.com,NaN,NaN,NaN,NaN
12,Rosy,Wakeford,NaN,NaN,NaN,NaN,NaN

# Merging dataset adding dataset inserting another dataset to main df

In [81]:
#adding/combining dataframe 
#Use one of the DF to include those change otherwise this remain view only, eg. ndf = pd.append(df,ignore_index=True, sort=False)
pd.set_option('display.max_rows',33)
ndf = ndf.append(ndf1, ignore_index=True, sort=False)

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_2980/276868568.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ndf = ndf.append(ndf1, ignore_index=True, sort=False)

In [82]:
ndf1

                    email   age  zip      full_name  gender fname     lname
0         jack.foly@email  10.0  NaN            NaN     NaN   NaN       NaN
1                    None   NaN  NaN            NaN     NaN   NaN       NaN
2         traci.saw@email  11.0  NaN            NaN     NaN   NaN       NaN
3         rosy.burk@email  23.0  NaN            NaN     NaN   NaN       NaN
4              jack@email  45.0  NaN            NaN     NaN   NaN       NaN
5      jhon.dow@email.com  65.0  NaN            NaN     NaN   NaN       NaN
6     jenny.dow@email.com  43.0  NaN            NaN     NaN   NaN       NaN
7     tom.hanks@email.com   2.0  NaN            NaN     NaN   NaN       NaN
8   saurabh.raj@email.com   4.0  NaN            NaN     NaN   NaN       NaN
9            td@email.com   NaN  0.0            NaN     NaN   NaN       NaN
10        noemp@email.com   NaN  NaN            NaN     NaN   NaN       NaN
11                    NaN   NaN  NaN            NaN     NaN   NaN       NaN
12                    NaN   NaN  NaN  Rosy Wakeford     NaN  Rosy  Wakeford
13        jack.foly@email  10.0  NaN            NaN     NaN   NaN       NaN
14                   None   NaN  NaN            NaN     NaN   NaN       NaN
15        traci.saw@email  11.0  NaN            NaN     NaN   NaN       NaN
16        rosy.burk@email  23.0  NaN            NaN     NaN   NaN       NaN
17             jack@email  45.0  NaN            NaN     NaN   NaN       NaN
18     jhon.dow@email.com  65.0  NaN            NaN     NaN   NaN       NaN
19    jenny.dow@email.com  43.0  NaN            NaN     NaN   NaN       NaN
20    tom.hanks@email.com   2.0  NaN            NaN     NaN   NaN       NaN
21  saurabh.raj@email.com   4.0  NaN            NaN     NaN   NaN       NaN
22           td@email.com   NaN  0.0            NaN     NaN   NaN       NaN
23        noemp@email.com   NaN  NaN            NaN     NaN   NaN       NaN
24                    NaN   NaN  NaN            NaN     NaN   NaN       NaN
25                    NaN   NaN  NaN  Rosy Wakeford     NaN  Rosy  Wakeford

# Drop column

In [83]:
# Drop Columns
#drop fname and lname column from dataframe
#inplace=True to commit changes to DF

ndf.drop(columns = ['lname','fname'], inplace = True)

In [92]:
ndf

                    email   age  zip      full_name  gender
1                    None   NaN  NaN            NaN     NaN
2         traci.saw@email  11.0  NaN            NaN     NaN
3         rosy.burk@email  23.0  NaN            NaN     NaN
4              jack@email  45.0  NaN            NaN     NaN
5      jhon.dow@email.com  65.0  NaN            NaN     NaN
..                    ...   ...  ...            ...     ...
47  saurabh.raj@email.com   4.0  NaN            NaN     NaN
48           td@email.com   NaN  0.0            NaN     NaN
49        noemp@email.com   NaN  NaN            NaN     NaN
50                    NaN   NaN  NaN            NaN     NaN
51                    NaN   NaN  NaN  Rosy Wakeford     NaN

[51 rows x 5 columns]

# Drop Row

In [84]:
ndf1.drop(index=7, inplace=True)

In [85]:
# Delete row from Dataframe
ndf.drop(index=0, inplace=True)

In [365]:
# 2nd way to use the filter or conditional deletion

fi = ndf['lname']=='Wakeford'
ndf[fi].index

Int64Index([12, 25, 38, 51], dtype='int64')

In [366]:
ndf.drop(index=ndf[fi].index, inplace=True)

In [367]:
ndf

                    email   age  zip full_name  gender fname lname
1                    None   NaN  NaN       NaN     NaN   NaN  None
2         traci.saw@email  11.0  NaN       NaN     NaN   NaN  None
3         rosy.burk@email  23.0  NaN       NaN     NaN   NaN  None
4              jack@email  45.0  NaN       NaN     NaN   NaN  None
5      jhon.dow@email.com  65.0  NaN       NaN     NaN   NaN  None
..                    ...   ...  ...       ...     ...   ...   ...
46    tom.hanks@email.com   2.0  NaN       NaN     NaN   NaN  None
47  saurabh.raj@email.com   4.0  NaN       NaN     NaN   NaN  None
48           td@email.com   NaN  0.0       NaN     NaN   NaN  None
49        noemp@email.com   NaN  NaN       NaN     NaN   NaN  None
50                    NaN   NaN  NaN       NaN     NaN   NaN  None

[47 rows x 7 columns]

In [ ]:
# Delete column drop column
ndf1.drop(columns=['fname','lname'], inplace=True)

In [ ]:
ndf1

In [ ]:
#df_people.loc[df_people['lname']=='jack@email',['lname','email']] =['Son','jack.son@email.com']
#df_people['full_name'] = df_people['fname'] + ' ' + df_people['lname']
df_people

# Sort data in dataframe - two way sort index or short by column value
# use inplace=True to keep sorted data in DF

In [ ]:
#sort by Index you can sort in decending by making ascending = True
df_people.sort_index(ascending=False)

In [ ]:
#Ascending order is default sort order
df_people.sort_values(by=['fname'], ascending=False)

In [ ]:
df_people.sort_values(by=['fname','lname'], ascending=False)

In [ ]:
#complecate sort on different columns
#Use Case - sort first name asceding than lname decending order
df_people.sort_values(['fname','lname'], ascending=[False, True])

In [97]:
#adding column to DF
df_people['salary']=1000

In [101]:
#updating each column
df_people.loc[0,'salary']=3500
df_people.loc[7,'salary']=5500

In [99]:
df_people.reset_index(inplace=True)
df_people['salary']= (df_people['salary'] * df_people['salary'].index)

In [102]:
df_people

,id,index,fname,lname,email,...,work_mode,dept,emp_type,language,salary
0,1001,0.0,Jack,Foly,jack.foly@email,...,remote,IT,emp,English;French,3500.0
1,1003,1.0,Tom,Alter,tom.alter@email,...,work from home,Sales,cwx,Spanish;French;English,1000.0
2,1002,2.0,Traci,Saw,traci.saw@email,...,office,Marketing,emp,Dutch;English,2000.0
3,1004,3.0,Rosy,Burk,rosy.burk@email,...,head office,Admin,cwx,Finish;English;Python,3000.0
4,1005,4.0,Jack,jack@email,jack@email,...,remote,Sales,emp,English;Hindi;Java:Spanish,4000.0
5,1006,5.0,Jhon,Dow,jhon.dow@email.com,...,office,Developer,emp,English:SQL:Python,5000.0
6,1007,6.0,Jenny,Dow,jenny.dow@email.com,...,Remote,Admin,cwx,English;Unix,6000.0
7,1008,7.0,Tom,Hanks,tom.hanks@email.com,...,office,Sales,emp,Hindi;Python-English,5500.0
8,1009,8.0,Raj,Saurabh,saurabh.raj@email.com,...,work from home,VP,emp,Dutch;Swiss;English,8000.0
9,1010,9.0,Terry,Dow,td@email.com,...,Office,Finance,emp,English,9000.0
10,0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,35000.0
11,7,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,60500.0

In [ ]:
#top and bottom 5 rows
df_people['salary'].nlargest(5)

In [ ]:
# bottom 5 salary
#df_people['salary'].nsmallest(5).index.max()
df_people['salary'].nsmallest(5)

In [ ]:
#complete dataset with top and bottom 5

df_people.nlargest(5, 'salary')

In [ ]:
df_people.nsmallest(5, 'salary')

# Grouping and Aggregating

In [103]:
df_people['salary'].median()

5250.0

In [ ]:
#default sorting order is ascending, if you want to sort values by decending use ('salary', ascending=False)
df_people.sort_values('salary', ascending=False)

In [ ]:
#merged_df = ndf.append(df_people, ignore_index=True)

In [106]:
df_people['salary'].median()
df_people

,id,index,fname,lname,email,...,work_mode,dept,emp_type,language,salary
0,1001,0.0,Jack,Foly,jack.foly@email,...,remote,IT,emp,English;French,3500.0
1,1003,1.0,Tom,Alter,tom.alter@email,...,work from home,Sales,cwx,Spanish;French;English,1000.0
2,1002,2.0,Traci,Saw,traci.saw@email,...,office,Marketing,emp,Dutch;English,2000.0
3,1004,3.0,Rosy,Burk,rosy.burk@email,...,head office,Admin,cwx,Finish;English;Python,3000.0
4,1005,4.0,Jack,jack@email,jack@email,...,remote,Sales,emp,English;Hindi;Java:Spanish,4000.0
5,1006,5.0,Jhon,Dow,jhon.dow@email.com,...,office,Developer,emp,English:SQL:Python,5000.0
6,1007,6.0,Jenny,Dow,jenny.dow@email.com,...,Remote,Admin,cwx,English;Unix,6000.0
7,1008,7.0,Tom,Hanks,tom.hanks@email.com,...,office,Sales,emp,Hindi;Python-English,5500.0
8,1009,8.0,Raj,Saurabh,saurabh.raj@email.com,...,work from home,VP,emp,Dutch;Swiss;English,8000.0
9,1010,9.0,Terry,Dow,td@email.com,...,Office,Finance,emp,English,9000.0
10,0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,35000.0
11,7,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,60500.0

In [107]:
fil = df_people['country']=='USA'
df_people.loc[fil, ['emp_type','salary']].value_counts()

emp_type  salary
cwx       6000.0    1
emp       3500.0    1
          5000.0    1
          9000.0    1
dtype: int64

In [109]:
df_grp = df_people.groupby(['country','emp_type'])

In [110]:
df_grp.get_group(('India','emp'))

,id,index,fname,lname,email,...,work_mode,dept,emp_type,language,salary
2,1002,2.0,Traci,Saw,traci.saw@email,...,office,Marketing,emp,Dutch;English,2000.0
8,1009,8.0,Raj,Saurabh,saurabh.raj@email.com,...,work from home,VP,emp,Dutch;Swiss;English,8000.0

In [111]:
df_grp['work_mode'].value_counts().loc['India']

emp_type  work_mode
emp       office            1
          work from home    1
Name: work_mode, dtype: int64

In [113]:
#country, emp_type column become index when df_grp was created for groupby country, emp_type
#you can created partition the df for one column by grouping country
df_grp['salary'].sum().loc[['India','USA']]

country  emp_type
India    emp         10000.0
USA      cwx          6000.0
         emp         17500.0
Name: salary, dtype: float64

In [114]:
df_grp['salary'].value_counts().loc[['India','USA']]

country  emp_type  salary
India    emp       2000.0    1
                   8000.0    1
USA      cwx       6000.0    1
         emp       3500.0    1
                   5000.0    1
                   9000.0    1
Name: salary, dtype: int64

In [115]:
df_grp['salary'].mean().loc[['India','USA']]

country  emp_type
India    emp         5000.000000
USA      cwx         6000.000000
         emp         5833.333333
Name: salary, dtype: float64

In [116]:
grp_country = df_people.groupby(df_people['country'])

In [117]:
grp_country.get_group('USA')

,id,index,fname,lname,email,...,work_mode,dept,emp_type,language,salary
0,1001,0.0,Jack,Foly,jack.foly@email,...,remote,IT,emp,English;French,3500.0
5,1006,5.0,Jhon,Dow,jhon.dow@email.com,...,office,Developer,emp,English:SQL:Python,5000.0
6,1007,6.0,Jenny,Dow,jenny.dow@email.com,...,Remote,Admin,cwx,English;Unix,6000.0
9,1010,9.0,Terry,Dow,td@email.com,...,Office,Finance,emp,English,9000.0

In [119]:
grp_country.get_group('USA').median()

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_2980/2828092444.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  grp_country.get_group('USA').median()

id        1006.5
index        5.5
salary    5500.0
dtype: float64

In [120]:
grp_country['salary'].mean().loc[['USA', 'India']]

country
USA      5875.0
India    5000.0
Name: salary, dtype: float64

In [121]:
#multiple statics


d = grp_country['salary'].agg(['mean','median','min','max']).loc[['India','USA','Canada']]

In [123]:
type(d)
d

           mean  median     min     max
country
India    5000.0  5000.0  2000.0  8000.0
USA      5875.0  5500.0  3500.0  9000.0
Canada   3000.0  3000.0  3000.0  3000.0

In [127]:
pd.set_option('display.max_columns',25)
grp_country.describe()

           id                                                              \
        count    mean       std     min      25%     50%      75%     max
country
Canada    1.0  1004.0       NaN  1004.0  1004.00  1004.0  1004.00  1004.0
Germany   1.0  1005.0       NaN  1005.0  1005.00  1005.0  1005.00  1005.0
India     2.0  1005.5  4.949747  1002.0  1003.75  1005.5  1007.25  1009.0
UK        2.0  1005.5  3.535534  1003.0  1004.25  1005.5  1006.75  1008.0
USA       4.0  1006.0  3.741657  1001.0  1004.75  1006.5  1007.75  1010.0

        index                                           salary          \
        count mean       std  min   25%  50%   75%  max  count    mean
country
Canada    1.0  3.0       NaN  3.0  3.00  3.0  3.00  3.0    1.0  3000.0
Germany   1.0  4.0       NaN  4.0  4.00  4.0  4.00  4.0    1.0  4000.0
India     2.0  5.0  4.242641  2.0  3.50  5.0  6.50  8.0    2.0  5000.0
UK        2.0  4.0  4.242641  1.0  2.50  4.0  5.50  7.0    2.0  3250.0
USA       4.0  5.0  3.741657  0.0  3.75  5.5  6.75  9.0    4.0  5875.0


                 std     min     25%     50%     75%     max
country
Canada           NaN  3000.0  3000.0  3000.0  3000.0  3000.0
Germany          NaN  4000.0  4000.0  4000.0  4000.0  4000.0
India    4242.640687  2000.0  3500.0  5000.0  6500.0  8000.0
UK       3181.980515  1000.0  2125.0  3250.0  4375.0  5500.0
USA      2322.893311  3500.0  4625.0  5500.0  6750.0  9000.0

In [ ]:
df_people.drop(columns='level_0', inplace=True)

In [156]:
#Find people know swiss?
lf = df_people['language'].str.contains('Hindi')
df_people

,level_0,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
0,0,0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,3500.0
1,1,1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,1000.0
2,2,2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,2000.0
3,3,3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,3000.0
4,4,4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,4000.0
5,5,5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,5000.0
6,6,6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,6000.0
7,7,7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,5500.0
8,8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000.0
9,9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000.0
10,10,11,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60500.0

In [183]:
#df_people[df_people['language'].str.contains('Hindi')]
#df_people.drop(columns='index',inplace=True)
#df_people.reset_index(inplace=True)
#df_people.drop(index=11, inplace=True)
#df_people.drop(index=10, inplace=True)
df_people.loc[df_people['language'].str.contains('Swiss')]

,level_0,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
8,8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000.0

In [184]:
#total number of emp by country

tot_emp = df_people['country'].value_counts()

In [288]:
tot_emp

USA        4
UK         2
India      2
Canada     1
Germany    1
Name: country, dtype: int64

In [187]:
#create group by country
lang_grp = df_people.groupby('country')

In [355]:
# this gives us the count of the column in group with its values
lang_grp['language'].value_counts()
# this count the occurance of column itsself without creating new column for count including T|F
lang_grp['language'].apply(lambda x: x.str.contains('Hindi').count())

country
Canada     1
Germany    1
India      2
UK         2
USA        4
Name: language, dtype: int64

# sum add the the bool True value where count count the bool value irrespective to T|F as we can see in above example

In [353]:
lang_grp['language'].apply(lambda x: x.str.contains('Hindi').sum())
#you will get true or false for country have language in condition and sum is the function to add the bool true value

country
Canada     0
Germany    1
India      0
UK         1
USA        0
Name: language, dtype: int64

In [363]:
lang_grp['emp_type'].sum().loc['India']

'empemp'

In [286]:
#creating series with result sum addup True value as False is not considered to sum
lang = lang_grp['language'].apply(lambda x: x.str.contains('Hindi').sum())
lang

country
Canada     0
Germany    1
India      0
UK         1
USA        0
Name: language, dtype: int64

In [356]:
# df_people['language'].apply(lambda x: x.str.contains('Hindi').sum())
# lang_grp['language'].value_counts()
df_people.loc[df_people['language'].str.contains('Hindi'),'country']

4    Germany
7         UK
Name: country, dtype: object

In [202]:
comp_df = pd.concat([tot_emp,lang], axis=True, sort=False)
#hin

In [203]:
comp_df

         country  language
USA            4         0
UK             2         1
India          2         0
Canada         1         0
Germany        1         1

In [204]:
df_people

,level_0,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
0,0,0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,3500.0
1,1,1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,1000.0
2,2,2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,2000.0
3,3,3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,3000.0
4,4,4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,4000.0
5,5,5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,5000.0
6,6,6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,6000.0
7,7,7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,5500.0
8,8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000.0
9,9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000.0

In [207]:
fil = df_people.loc[df_people['language'].str.contains('Hindi'), 'country'].value_counts()
fil

Germany    1
UK         1
Name: country, dtype: int64

In [208]:
mydf = pd.concat([tot_emp,fil], axis=True, sort=False)
mydf

         country  country
USA            4      NaN
UK             2      1.0
India          2      NaN
Canada         1      NaN
Germany        1      1.0

In [209]:
mydf.columns

Index(['country', 'country'], dtype='object')

In [214]:
comp_df['%HindiSpeaker'] = (comp_df['language']/comp_df['country'])*100

In [314]:
comp_df

         country  language  %HindiSpeaker
USA            4         0            0.0
UK             2         1           50.0
India          2         0            0.0
Canada         1         0            0.0
Germany        1         1          100.0

In [212]:
df_people['country'].value_counts(normalize=True)

USA        0.4
UK         0.2
India      0.2
Canada     0.1
Germany    0.1
Name: country, dtype: float64

Int64Index([2, 8], dtype='int64')

In [144]:
lang_grp[['emp_type']].value_counts()

NameError: name 'lang_grp' is not defined

# Merge DataFrame 
options to merge dataframe horizontilly or vertically
option1 - use pd.concat and use the axis how to merge (0- rows, 1-column side by side)
Option2- only to append df to anohter df use append()method

In [2]:
import pandas as pd
import numpy as np

In [6]:
df1 = pd.DataFrame(
{
    'A':['A0','B0','C0'],
    'B':['A1','B1','C1'],
    'C':['A2','B2','C2']
}, index=[2,4,6])

df2 = pd.DataFrame(
{
    'E':['E0','E0','E0'],
    'F':['E1','E1','E1'],
    'G':['E2','E2','E2']
}, index=[1,3,5])

In [7]:
df1

    A   B   C
2  A0  A1  A2
4  B0  B1  B2
6  C0  C1  C2

In [8]:
df2

    E   F   G
1  E0  E1  E2
3  E0  E1  E2
5  E0  E1  E2

In [17]:
#ignore_index (False - keep the original index value) and (True - will reset to default index [start from 0])
df2.append(df1, ignore_index=False)

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_22699/4091257180.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df1, ignore_index=False)

     E    F    G    A    B    C
1   E0   E1   E2  NaN  NaN  NaN
3   E0   E1   E2  NaN  NaN  NaN
5   E0   E1   E2  NaN  NaN  NaN
2  NaN  NaN  NaN   A0   A1   A2
4  NaN  NaN  NaN   B0   B1   B2
6  NaN  NaN  NaN   C0   C1   C2

In [22]:
#concat resule same as append
pd.concat([df1,df2], ignore_index=True, sort=False)

     A    B    C    E    F    G
0   A0   A1   A2  NaN  NaN  NaN
1   B0   B1   B2  NaN  NaN  NaN
2   C0   C1   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   E0   E1   E2
4  NaN  NaN  NaN   E0   E1   E2
5  NaN  NaN  NaN   E0   E1   E2